# Oфіціцйний базовий image від golang, називаємо його builder 
FROM golang as builder
WORKDIR /src
# Копіюємо контент директоріі в контент builder
COPY src .
# виконати збірку коду, додаємо опцію, що дозволяє кросс-компіляцію(це одна із фіч мови go, бінарний код для різних платформ).
# Цей етап замість мануального 'go build -o bin/app src/main.go'
RUN CGO_ENABLED=0 go build -o app


# Переключаємось на пустий базовий образ 
FROM scratch
# Додаємо директорію з контентом
ADD ./html /html
# Копіюємо бінарний файл, що буде результатом етапу збірки 
COPY --from=builder /src/app .
# Вказуємо як саме зібрати сервер та який порт сервер слухає за замовчуванням 
ENTRYPOINT ["/app"]
EXPOSE 8082